.sbom/pipdeptree.3.11.dot
digraph {
	"annotated-types" [label="annotated-types\n0.8.0"]
	"antlr4-python3-runtime" [label="antlr4-python3-runtime\n4.13.2"]
	"boolean-py" [label="boolean.py\n5.0"]
	"charset-normalizer" [label="charset-normalizer\n3.5.1"]
	"cyclonedx-bom" -> "cyclonedx-python-lib" [label=">=8.0,<12"]
	"cyclonedx-bom" -> "packageurl-python" [label=">=0.11,<2"]
	"cyclonedx-bom" -> "pip-requirements-parser" [label=">=32.0,<33.0"]
	"cyclonedx-bom" -> chardet [label=">=5.1,<6.0"]
	"cyclonedx-bom" -> packaging [label=">=22,<27"]
	"cyclonedx-bom" [label="cyclonedx-bom\n7.3.1"]
	"cyclonedx-python-lib" -> "license-expression" [label=">=30,<31"]
	"cyclonedx-python-lib" -> "packageurl-python" [label=">=0.11,<2"]
	"cyclonedx-python-lib" -> "py-serializable" [label=">=2.1.0,<3.0.0"]
	"cyclonedx-python-lib" -> "typing-extensions" [label=">=4.6,<5.0"]
	"cyclonedx-python-lib" -> jsonschema [label="[validation] >=4.25,<5.0"]
	"cyclonedx-python-lib" -> lxml [label="[validation] >=4,<7"]
	"cyclonedx-python-lib" -> referencing [label="[validation] >=0.28.4"]
	"cyclonedx-python-lib" -> sortedcontainers [label=">=2.4.0,<3.0.0"]
	"cyclonedx-python-lib" [label="cyclonedx-python-lib\n11.12.0"]
	"dagster-pipes" [label="dagster-pipes\n1.9.11"]
	"docker-compose-graph" -> "python-dotenv" [label="any"]
	"docker-compose-graph" -> graphviz [label="any"]
	"docker-compose-graph" -> jinja2 [label="any"]
	"docker-compose-graph" -> pydot [label="any"]
	"docker-compose-graph" -> pyyaml [label="any"]
	"docker-compose-graph" [label="docker-compose-graph\n1.0.0.post1.dev7+g78fcf8e95"]
	"docstring-parser" [label="docstring_parser\n0.18.0"]
	"email-validator" -> dnspython [label=">=2.0.0"]
	"email-validator" -> idna [label=">=2.0.0"]
	"email-validator" [label="email-validator\n2.3.0"]
	"grpcio-health-checking" -> grpcio [label=">=1.71.2"]
	"grpcio-health-checking" -> protobuf [label=">=5.26.1,<6.0.dev0"]
	"grpcio-health-checking" [label="grpcio-health-checking\n1.71.2"]
	"jsonschema-specifications" -> referencing [label=">=0.31.0"]
	"jsonschema-specifications" [label="jsonschema-specifications\n2025.9.1"]
	"license-expression" -> "boolean-py" [label=">=4.0"]
	"license-expression" [label="license-expression\n30.4.4"]
	"markdown-it-py" -> mdurl [label="~=0.1"]
	"markdown-it-py" [label="markdown-it-py\n4.2.0"]
	"nab-index" -> "nab-provider" [label="==0.0.17"]
	"nab-index" -> "typing-extensions" [label=">=4.6"]
	"nab-index" -> packaging [label=">=24.0"]
	"nab-index" -> truststore [label=">=0.10"]
	"nab-index" -> urllib3 [label=">=2.0"]
	"nab-index" [label="nab-index\n0.0.17"]
	"nab-markersets" [label="nab-markersets\n0.0.17"]
	"nab-project" -> "nab-index" [label="==0.0.17"]
	"nab-project" -> "nab-markersets" [label="==0.0.17"]
	"nab-project" -> "nab-provider" [label="==0.0.17"]
	"nab-project" -> "nab-resolver" [label="==0.0.17"]
	"nab-project" -> "pyproject-hooks" [label=">=1.2"]
	"nab-project" -> "tomli-w" [label=">=1.2"]
	"nab-project" -> "typing-extensions" [label=">=4.6"]
	"nab-project" -> build [label=">=1.2"]
	"nab-project" -> installer [label=">=1.0"]
	"nab-project" -> packaging [label=">=24.0"]
	"nab-project" -> tomli [label=">=2.2"]
	"nab-project" [label="nab-project\n0.0.17"]
	"nab-provider" -> "nab-markersets" [label="==0.0.17"]
	"nab-provider" -> "nab-resolver" [label="==0.0.17"]
	"nab-provider" -> "typing-extensions" [label=">=4.6"]
	"nab-provider" [label="nab-provider\n0.0.17"]
	"nab-resolver" [label="nab-resolver\n0.0.17"]
	"openstudiolandscapes-dagstercodelocation-streamingprocess" -> dagster [label="==1.9.11"]
	"openstudiolandscapes-dagstercodelocation-streamingprocess" [label="OpenStudioLandscapes-DagsterCodeLocation-StreamingProcess\n0.0.0"]
	"openstudiolandscapes-filebrowser" -> "docker-compose-graph" [label="any"]
	"openstudiolandscapes-filebrowser" -> "email-validator" [label="any"]
	"openstudiolandscapes-filebrowser" -> "openstudiolandscapes-dagstercodelocation-streamingprocess" [label="any"]
	"openstudiolandscapes-filebrowser" -> "ruamel-yaml" [label="any"]
	"openstudiolandscapes-filebrowser" -> bcrypt [label="any"]
	"openstudiolandscapes-filebrowser" -> dagster [label="==1.9.11"]
	"openstudiolandscapes-filebrowser" -> gitpython [label="any"]
	"openstudiolandscapes-filebrowser" -> pyyaml [label="any"]
	"openstudiolandscapes-filebrowser" -> snakemd [label="any"]
	"openstudiolandscapes-filebrowser" [label="OpenStudioLandscapes-filebrowser\n0.0.0"]
	"packageurl-python" [label="packageurl-python\n0.17.6"]
	"pathlib-abc" [label="pathlib_abc\n0.5.2"]
	"pip-requirements-parser" -> packaging [label="any"]
	"pip-requirements-parser" -> pyparsing [label="any"]
	"pip-requirements-parser" [label="pip-requirements-parser\n32.0.1"]
	"py-serializable" -> defusedxml [label=">=0.7.1,<0.8.0"]
	"py-serializable" [label="py-serializable\n2.1.0"]
	"pydantic-core" -> "typing-extensions" [label=">=4.14.1"]
	"pydantic-core" [label="pydantic_core\n2.46.5"]
	"pyproject-hooks" [label="pyproject_hooks\n1.2.0"]
	"python-dateutil" -> six [label=">=1.5"]
	"python-dateutil" [label="python-dateutil\n2.9.0.post0"]
	"python-dotenv" [label="python-dotenv\n1.2.3"]
	"rfc3339-validator" -> six [label="any"]
	"rfc3339-validator" [label="rfc3339-validator\n0.1.4"]
	"rfc3986-validator" [label="rfc3986-validator\n0.1.1"]
	"rfc3987-syntax" -> lark [label=">=1.2.2"]
	"rfc3987-syntax" [label="rfc3987-syntax\n1.1.0"]
	"rpds-py" [label="rpds-py\n2026.6.3"]
	"ruamel-yaml" [label="ruamel.yaml\n0.19.1"]
	"tomli-w" [label="tomli_w\n1.2.0"]
	"typing-extensions" [label="typing_extensions\n4.16.0"]
	"typing-inspection" -> "typing-extensions" [label=">=4.15.0"]
	"typing-inspection" [label="typing-inspection\n0.4.4"]
	"universal-pathlib" -> "pathlib-abc" [label=">=0.5.1,<0.6.0"]
	"universal-pathlib" -> fsspec [label=">=2024.5.0"]
	"universal-pathlib" [label="universal_pathlib\n0.3.10"]
	"uri-template" [label="uri-template\n1.3.0"]
	alembic -> "typing-extensions" [label=">=4.12"]
	alembic -> mako [label="any"]
	alembic -> sqlalchemy [label=">=1.4.23"]
	alembic [label="alembic\n1.19.2"]
	arrow -> "python-dateutil" [label=">=2.7.0"]
	arrow -> tzdata [label="any"]
	arrow [label="arrow\n1.4.0"]
	attrs [label="attrs\n26.1.0"]
	bcrypt [label="bcrypt\n5.0.0"]
	build -> "pyproject-hooks" [label="any"]
	build -> packaging [label=">=24.0"]
	build [label="build\n1.6.0"]
	certifi [label="certifi\n2026.7.22"]
	chardet [label="chardet\n5.2.0"]
	click [label="click\n8.5.0"]
	coloredlogs -> humanfriendly [label=">=7.1"]
	coloredlogs [label="coloredlogs\n14.0"]
	dagster -> "antlr4-python3-runtime" [label="any"]
	dagster -> "dagster-pipes" [label="==1.9.11"]
	dagster -> "docstring-parser" [label="any"]
	dagster -> "grpcio-health-checking" [label=">=1.44.0"]
	dagster -> "python-dotenv" [label="any"]
	dagster -> "typing-extensions" [label=">=4.10.0,<5"]
	dagster -> "universal-pathlib" [label="any"]
	dagster -> alembic [label=">=1.2.1,!=1.6.3,!=1.7.0,!=1.11.0"]
	dagster -> click [label=">=5.0"]
	dagster -> coloredlogs [label=">=6.1,<=14.0"]
	dagster -> filelock [label="any"]
	dagster -> grpcio [label=">=1.44.0"]
	dagster -> jinja2 [label="any"]
	dagster -> packaging [label=">=20.9"]
	dagster -> protobuf [label=">=4,<6"]
	dagster -> pydantic [label=">=2,<3.0.0"]
	dagster -> pytz [label="any"]
	dagster -> pyyaml [label=">=5.1"]
	dagster -> requests [label="any"]
	dagster -> rich [label="any"]
	dagster -> setuptools [label="any"]
	dagster -> six [label="any"]
	dagster -> sqlalchemy [label=">=1.0,<3"]
	dagster -> structlog [label="any"]
	dagster -> tabulate [label="any"]
	dagster -> tomli [label="<3"]
	dagster -> toposort [label=">=1.0"]
	dagster -> tqdm [label="<5"]
	dagster -> watchdog [label=">=0.8.3,<6"]
	dagster [label="dagster\n1.9.11"]
	defusedxml [label="defusedxml\n0.7.1"]
	dnspython [label="dnspython\n2.8.0"]
	filelock [label="filelock\n3.32.5"]
	fqdn [label="fqdn\n1.5.1"]
	fsspec [label="fsspec\n2026.7.0"]
	gitdb -> smmap [label=">=3.0.1,<6"]
	gitdb [label="gitdb\n4.0.12"]
	gitpython -> gitdb [label=">=4.0.1,<5"]
	gitpython [label="GitPython\n3.1.62"]
	graphviz [label="graphviz\n0.21"]
	greenlet [label="greenlet\n3.5.5"]
	grpcio -> "typing-extensions" [label="~=4.12"]
	grpcio [label="grpcio\n1.83.1"]
	humanfriendly [label="humanfriendly\n10.0"]
	idna [label="idna\n3.19"]
	installer [label="installer\n1.0.1"]
	isoduration -> arrow [label=">=0.15.0"]
	isoduration [label="isoduration\n20.11.0"]
	jinja2 -> markupsafe [label=">=2.0"]
	jinja2 [label="Jinja2\n3.1.6"]
	jsonpointer [label="jsonpointer\n3.1.1"]
	jsonschema -> "jsonschema-specifications" [label=">=2023.3.6"]
	jsonschema -> "rfc3339-validator" [label="[format-nongpl] any"]
	jsonschema -> "rfc3986-validator" [label="[format-nongpl] >0.1.0"]
	jsonschema -> "rfc3987-syntax" [label="[format-nongpl] >=1.1.0"]
	jsonschema -> "rpds-py" [label=">=0.25.0"]
	jsonschema -> "uri-template" [label="[format-nongpl] any"]
	jsonschema -> attrs [label=">=22.2.0"]
	jsonschema -> fqdn [label="[format-nongpl] any"]
	jsonschema -> idna [label="[format-nongpl] any"]
	jsonschema -> isoduration [label="[format-nongpl] any"]
	jsonschema -> jsonpointer [label="[format-nongpl] >1.13"]
	jsonschema -> referencing [label=">=0.28.4"]
	jsonschema -> webcolors [label="[format-nongpl] >=24.6.0"]
	jsonschema [label="jsonschema\n4.26.0"]
	lark [label="lark\n1.3.1"]
	lxml [label="lxml\n6.1.3"]
	mako -> markupsafe [label=">=2.0"]
	mako [label="Mako\n1.4.1"]
	markupsafe [label="MarkupSafe\n3.0.3"]
	mdurl [label="mdurl\n0.1.2"]
	packaging [label="packaging\n26.3"]
	pip [label="pip\n26.2.1"]
	pipdeptree -> "nab-index" [label=">=0.0.11"]
	pipdeptree -> "nab-project" [label=">=0.0.14"]
	pipdeptree [label="pipdeptree\n4.2.3"]
	protobuf [label="protobuf\n5.29.6"]
	pydantic -> "annotated-types" [label=">=0.6.0"]
	pydantic -> "pydantic-core" [label="==2.46.5"]
	pydantic -> "typing-extensions" [label=">=4.14.1"]
	pydantic -> "typing-inspection" [label=">=0.4.2"]
	pydantic [label="pydantic\n2.13.5"]
	pydot -> pyparsing [label=">=3.1.0"]
	pydot [label="pydot\n4.0.1"]
	pygments [label="Pygments\n2.21.0"]
	pyparsing [label="pyparsing\n3.3.2"]
	pytz [label="pytz\n2026.3.post1"]
	pyyaml [label="PyYAML\n6.0.3"]
	referencing -> "rpds-py" [label=">=0.7.0"]
	referencing -> "typing-extensions" [label=">=4.4.0"]
	referencing -> attrs [label=">=22.2.0"]
	referencing [label="referencing\n0.37.0"]
	requests -> "charset-normalizer" [label=">=2,<4"]
	requests -> certifi [label=">=2023.5.7"]
	requests -> idna [label=">=2.5,<4"]
	requests -> urllib3 [label=">=1.26,<3"]
	requests [label="requests\n2.34.2"]
	rich -> "markdown-it-py" [label=">=2.2.0"]
	rich -> pygments [label=">=2.13.0,<3.0.0"]
	rich [label="rich\n15.0.0"]
	setuptools [label="setuptools\n84.0.0"]
	six [label="six\n1.17.0"]
	smmap [label="smmap\n5.0.3"]
	snakemd [label="SnakeMD\n2.4.1"]
	sortedcontainers [label="sortedcontainers\n2.4.0"]
	sqlalchemy -> "typing-extensions" [label=">=4.6.0"]
	sqlalchemy -> greenlet [label=">=1"]
	sqlalchemy [label="SQLAlchemy\n2.0.52"]
	structlog [label="structlog\n26.1.0"]
	tabulate [label="tabulate\n0.10.0"]
	tomli [label="tomli\n2.4.1"]
	toposort [label="toposort\n1.10"]
	tqdm [label="tqdm\n4.70.0"]
	truststore [label="truststore\n0.10.4"]
	tzdata [label="tzdata\n2026.3"]
	urllib3 [label="urllib3\n2.7.0"]
	watchdog [label="watchdog\n5.0.3"]
	webcolors [label="webcolors\n25.10.0"]
	wheel -> packaging [label=">=24.0"]
	wheel [label="wheel\n0.48.0"]
}
